Repository: mblwhoi/dla_manuscripts
Catalog: sites/all/modules/term_fields/translations/term_fields.*.po
Languages: fr

source: Field
fr: Champ

source: Vocabulary
fr: Vocabulaire

source: Operations
fr: Opérations

source: There are no fields defined yet.
fr: Il n'y a auncun champs de défini pour le moment.

source: Choose a vocabulary to assign this field to. Only terms in this vocabulary will be able to use this field. Cannot be changed later.
fr: Sélectionnez un vocabulaire à assigner à ce champ. Seuls les termes dans ce vocabulaire pourront utiliser ce champ. Cela ne peut pas être modifié par la suite.

source: Field ID
fr: ID du champ

source: The machine-readable name of the field. This name must contain only lowercase letters, numbers, and underscores. This name cannot be changed.
fr: Le nom-machine de ce champ. Ce nom doit seulement contenir des caractères en minuscules, des chiffres et des caractères de soulignement. Ce nom ne peut êter modifié après.

source: Title
fr: Titre

source: A human-readable name to be used as the label for this field.
fr: Le nom affiché qui sera utilisé comme libellé pour ce champ.

source: Enter a short description of this field to explain what the field is used for.
fr: Entrez une courte description de ce champ pour expliquer ce à quoi il est utilisé.

source: Field type
fr: Type du champ

source: File
fr: Fichier

source: Integer
fr: Entier

source: Select list
fr: Liste de sélection

source: Text area (multiple rows)
fr: Zone de texte (plusieurs lignes)

source: Text field
fr: Champ texte

source: Define what type of field to use. Single line textboxes should be used for fields such as names and dates, while multi line textareas should be used for longer fields, such as biographies. Cannot be changed later.
fr: Définissez quel type de champ à utiliser. Les champs textes doivent être utilisés pour des champs tels que les noms ou les dates, tandis que les zones de textes (plusieurs lignes) doivent être utilisées pour des champs plus longs, comme les biographies. Cela ne peut être changé ultérieurement.

source: Weight
fr: Poids

source: Heavier weighted items get put at the bottom of lists.
fr: Les élément de poids forts sont insérés à la fin des listes.

source: Save
fr: Enregistrer

source: You have to <a href="@add-vocabulary">add a vocabulary</a> before you can add fields.
fr: Vous devez <a href="@add-vocabulary">ajouter un vocabulaire</a> avant de pouvoir ajouter des champs.

source: The field ID must contain only lowercase letters, numbers, and underscores. It should also begin by an alphabetic character and cannot finish by an underscore.
fr: Le champ ID ne doit contenir que des minuscules, des chiffres et des caractères de soulignement. Ils doivent de surcroît commencer par une lettre et ne peuvent finir par un caractère de soulignement.

source: The field ID %fid cannot be used. It is either already being used by another field, or is a reserved internal name.
fr: Le champ ID %fid ne peut être utilisé. Ou bien l est déjà utilisé pour un autre champ, ou alors il est réservé en interne.

source: The field %title (%fid) has been created.
fr: Le champ %title (%fid) a été créé.

source: You should now specify some options for your select field.
fr: Vous devez maintenant spécifier des options pour le champ que vous avez sélecionné.

source: Date field format
fr: Format du champ de date

source: The format to be used when displaying date fields.
fr: Le format à utiliser pour l'affichage des champs de date.

source: Custom date format
fr: Format de date personnalisé

source: A user-defined date format. If set, it will be used instead of what is set in the Date field format field. Leave blank to disable. See the <a href="@url">PHP manual</a> for available options.
fr: Un format de date défini par l'utilisateur. S'il est renseigné, il sera utilisé à la place de celui qui a été indiqué dans le champ Format du champ de date. Laissez ce champ vide pour le désactiver. Référez-vous au <a href="@url">manuel PHP</a> pour connaître les options possibles.

source: Fields per page
fr: Champs par page

source: Number of fields to show per page on the fields administration page.
fr: Le nombre de champs à afficher par page sur la page d'administration des champs.

source: The Fields per page value must be numeric.
fr: La valeur des Champs par page doit être numérique.

source: You can change the title of this field here.
fr: Vous pouvez changer le titre de ce champ ici.

source: You can change the description of this field here.
fr: Vous pouvez modifier la description de ce champ ici.

source: Allowed values list
fr: Liste des valeurs autorisées

source: The possible values this field can contain. Enter one value per line, in the format key|label. The key is the value that will be stored in the database, and it must match the field storage type (text). The label is optional, and the key will be used as the label if no label is specified.
fr: Les valeurs possibles que ce champ peut avoir. Entrez une valeur par ligne, dans le format clé|libellé. La clé est la valeur qui sera enregistrée dans la base de données et doit respecter le type utilisé pour son stockage (teste). Le libellé est optionnel et la clé sera utilisée comme libellé si aucun libellé n'est fourni.

source: Permitted file extensions
fr: Extensions de fichier autorisées

source: Extensions that users in this role can upload. Separate extensions with a space and do not include the leading dot.
fr: Extensions que l'utilisateur associé à ce rôle peut transférer. Séparez les extensions avec un espace et n'incluez pas le point en début.

source: Maximum file size per upload
fr: Taille maximale de fichier par transfert

source: The maximum size of a file a user can upload.
fr: La taille maximale de fichier qu'un utilisateur peut transférer.

source: MB
fr: Mo

source: Your PHP settings limit the maximum file size per upload to %size.
fr: Votre configuration PHP limite la taille maximale des fichiers à %size par transfert.

source: Fields weighted heavier appear at the bottom of lists.
fr: Les champs de poid fort apparaissent en bas des listes.

source: Delete
fr: Supprimer

source: Edit %fid field
fr: Éditer le champ %fid

source: The field %fid has been updated.
fr: Le champ %fid a été mis à jour.

source: Are you sure you want to delete the term field %fid?
fr: Êtes-vous sûr de vouloir supprimer le champ de terme %fid ?

source: If you have any content left in this field, it will be lost. This action cannot be undone.
fr: Si vous avez un quelconque contenu existant pour ce champ, il sera perdu. Cette action est irréversible.

source: The field %fid has been deleted.
fr: Le terme %fid a été supprimé.

source: Current file: <a href="@filepath">@filename</a>.
fr: Fichier courant : <a href="@filepath">@filename</a>.

source: There are no fields defined for the vocabulary that this term is a part of.
fr: Il n'y a aucun champ défini pour le vocabulaire auquel appartient ce terme.

source: Field %fid must be numeric. This field was not set.
fr: Le champs %fid doit être numérique. Ce champ n'a pas été enregistré.

source: Year
fr: Année

source: Month
fr: Mois

source: Day
fr: Jour

source: A value must be specified for month, day and year. If you want to make this field blank, unset all three fields.
fr: Une valeur doit être spécifiée pour le mois, l'année et le jour. Si vous souhaitez ce champ vide, videz les trois champs.

source: Edit
fr: Éditer

source: @description - *RAW*
fr: @description - *SAISIE BRUTE UTILISATEUR*

source: administer term fields
fr: administrer les champs de terme

source: Fields
fr: Champs

source: An overview of term fields.
fr: Une vue d'ensemble des champs de terme.

source: Add field
fr: Ajouter un champ

source: Form used to create new term fields.
fr: Formulaire utilisé pour créer de nouveaux champs de terme.

source: Settings
fr: Paramètres

source: Form used to change field settings.
fr: Formulaire utilisé pour modifier les paramètr'es d'un champ.

source: Edit field
fr: Éditer le champ

source: Form used to edit term fields.
fr: Formulaire utilisé pour éditer des champs de terme.

source: Delete field
fr: Supprimer le champ

source: Form used to delete term fields.
fr: Formulaire utilisé pour supprimer des champs de terme.

source: Term Fields
fr: Champs de terme

source: Allows adminitrators to define fields for taxonomy terms in the same way that CCK allows administrators to define fields for nodes.
fr: Autorise les administrateurs à définir des champs pour les termes de taxonomie de la même manière dont CCK permet de créer des champs pour les noeuds.

source: Term fields
fr: Champs de terme

source: The value of %fid for this particular term.
fr: La valeur de %fid pour ce terme particulier.

source: Link this field to its term
fr: Lier ce champ à ses termes
