Repository: mblwhoi/dla_manuscripts
Catalog: sites/all/modules/imce_mkdir/translations/*.po
Languages: hu, ja

source: IMCE Mkdir
ja: IMCE ディレクトリ作成

source: Adds directory creation functionality to IMCE
hu: Könyvtárak létrehozására teszi képessé az IMCE modult.
ja: IMCE にディレクトリ作成機能を追加します。

source: New directory
hu: Új könyvtár
ja: 新しいディレクトリ

source: You are not alllowed to create more than %num directories.
hu: %num könyvtárnál több létrehozása nem engedélyezett.
ja: %num 以上のディレクトリの作成は許可されていません。

source: Directory name may contain only alphanumeric characters, hyphen and underscore.
hu: A könyvtárak neve kizárólag betűket, számokat, kötőjelet és aláhúzás karaktereket tartalmazhat.
ja: ディレクトリ名には英数字、ハイフン（-）、アンダースコア（_）のみが使用できます。

source: Directory %dir already exists.
hu: %dir könyvtár már létezik.
ja: ディレクトリ %dir は既に存在します。

source: Create directories
hu: Könyvtárak létrehozása
ja: ディレクトリの作成

source: Maximum number of sub-directories
hu: Engedélyezett alkönyvtárak száma
ja: サブディレクトリの最大数

source: This setting is only applicable if you allow directory creation under any of the predefined directories. Define here the maximum number of subdirectories a directory can have. Setting this to 0 removes the limit and also allows infinite subdirectory depth.
hu: Ez a beállítás lehetővé teszi alkönyvtárak létrehozását a felhasználói könyvtárakban. Itt állítható be a könyvtáranként lehetséges alkönyvtárak maximális száma. Ezt nullára állítva tetszőleges számú alkönyvtár hozható létre.
ja: あらかじめ定義したディレクトリ以下でのサブディレクトリの作成を許可した場合にのみ、この設定が適用されます。 ひとつのディレクトリ内に作成可能なサブディレクトリの最大値を指定してください。 サブディレクトリの作成数およびディレクトリ階層を無制限にしたい場合は 0 を入力してください。

source: Directory name
hu: Könyvtár neve
ja: ディレクトリ名

source: Create
hu: Létrehozás
ja: 作成

source: Directory creation failed!
hu: A könyvtár létrehozása nem sikerült!
ja: ディレクトリの作成に失敗しました！

source: imce_mkdir
ja: IMCE ディレクトリ作成
